#Завдання №179

a=int(input('Введіть час в хвилинах: '))
if (1 <= a <= 3) or (7 <= a <= 9) or (13 <= a <= 15) or (19 <= a <= 21) or (25 <= a <= 27) or (31 <= a <= 33) or (37 <= a <= 39) or (43 <= a <= 45) or (49 <= a <= 51) or (55 <= a <= 57):
    print('Зелеений')
elif a==(4) or a==(10) or a==(16) or a==(22) or a==(28) or a==(34) or a==(40) or a==(46) or a==(52) or a==(58):
    print('Жовтий')
elif (5 <= a <= 6) or (11 <= a <= 12) or (17 <= a <= 18) or (23 <= a <= 24) or (29 <= a <= 30) or (35 <= a <= 36) or (41 <= a <= 42) or (47 <= a <= 48) or (53 <= a <= 54) or (59 <= a <= 60):
    print('Червоний')